AccumulationRegisters/ЗанятыеПозицииШтатногоРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ЗанятыеПозицииШтатногоРасписания</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловноеДвижение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловноеКоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтменыУсловногоДвижения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БронированиеПозиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременноеДвижение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗанятыеПозицииШтатногоРасписания/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Пропустить = Ложь;
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ПропуститьОбновлениеУсловныхДвижений", Пропустить) И Пропустить Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТекущийНабор", ЭтотОбъект);
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТекущийНабор.Период КАК Период,
		|	ТекущийНабор.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	ТекущийНабор.КоличествоСтавок КАК КоличествоСтавок,
		|	ТекущийНабор.Сотрудник КАК Сотрудник,
		|	ТекущийНабор.УсловноеДвижение КАК УсловноеДвижение,
		|	ТекущийНабор.ДатаОтменыУсловногоДвижения КАК ДатаОтменыУсловногоДвижения,
		|	ТекущийНабор.ВидДвижения КАК ВидДвижения
		|ПОМЕСТИТЬ ВТТекущийНабор
		|ИЗ
		|	&ТекущийНабор КАК ТекущийНабор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПредыдущийНабор.Сотрудник КАК Сотрудник,
		|	ПредыдущийНабор.Период КАК Период,
		|	ПредыдущийНабор.ДатаОтменыУсловногоДвижения КАК ДатаОтменыУсловногоДвижения,
		|	ПредыдущийНабор.УсловноеДвижение КАК УсловноеДвижение
		|ПОМЕСТИТЬ ВТНаборРегистратора
		|ИЗ
		|	РегистрНакопления.ЗанятыеПозицииШтатногоРасписания КАК ПредыдущийНабор
		|ГДЕ
		|	ПредыдущийНабор.Регистратор = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредыдущийНабор.Сотрудник КАК Сотрудник,
		|	ПредыдущийНабор.Период КАК Период,
		|	ПредыдущийНабор.ДатаОтменыУсловногоДвижения КАК ДатаОтменыУсловногоДвижения,
		|	ИСТИНА КАК УдаляемаяЗапись
		|ПОМЕСТИТЬ ВТИзмененныеПозиции
		|ИЗ
		|	ВТНаборРегистратора КАК ПредыдущийНабор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТекущийНабор КАК ТекущийНабор
		|		ПО (ТекущийНабор.Период = ПредыдущийНабор.Период)
		|			И (ТекущийНабор.Сотрудник = ПредыдущийНабор.Сотрудник)
		|			И (ТекущийНабор.УсловноеДвижение = ПредыдущийНабор.УсловноеДвижение)
		|			И (ТекущийНабор.ДатаОтменыУсловногоДвижения = ПредыдущийНабор.ДатаОтменыУсловногоДвижения)
		|ГДЕ
		|	ТекущийНабор.Сотрудник ЕСТЬ NULL 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТекущийНабор.Сотрудник,
		|	ТекущийНабор.Период,
		|	ТекущийНабор.ДатаОтменыУсловногоДвижения,
		|	ЛОЖЬ
		|ИЗ
		|	ВТТекущийНабор КАК ТекущийНабор";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДругиеНаборы.Регистратор КАК Регистратор,
		|	ДругиеНаборы.НомерСтроки,
		|	ДругиеНаборы.УсловноеКоличествоСтавок,
		|	ВЫБОР
		|		КОГДА ИзмененныеПозиции.УдаляемаяЗапись
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОчисткаРесурса
		|ИЗ
		|	ВТИзмененныеПозиции КАК ИзмененныеПозиции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеПозицииШтатногоРасписания КАК ДругиеНаборы
		|		ПО (ДругиеНаборы.Период > ИзмененныеПозиции.Период)
		|			И (ДругиеНаборы.ДатаОтменыУсловногоДвижения < ИзмененныеПозиции.Период)
		|			И (ДругиеНаборы.Сотрудник = ИзмененныеПозиции.Сотрудник)
		|ГДЕ
		|	ДругиеНаборы.Регистратор <> &Регистратор
		|	И ДругиеНаборы.УсловноеДвижение
		|ИТОГИ ПО
		|	Регистратор";
	
	// Перепишем движения других регистраторов.
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыНакопления.ЗанятыеПозицииШтатногоРасписания.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		
		ЗаписатьНабор = Ложь;
		ВыборкаНомеровСтрок = Выборка.Выбрать();
		Пока ВыборкаНомеровСтрок.Следующий() Цикл
			
			Если ВыборкаНомеровСтрок.ОчисткаРесурса Тогда
				КоличествоСтавок = 0;
			Иначе
				КоличествоСтавок = ВыборкаНомеровСтрок.УсловноеКоличествоСтавок;
			КонецЕсли;
			
			Если НаборЗаписей[ВыборкаНомеровСтрок.НомерСтроки - 1].КоличествоСтавок <> КоличествоСтавок Тогда
				
				ЗаписатьНабор = Истина;
				НаборЗаписей[ВыборкаНомеровСтрок.НомерСтроки - 1].КоличествоСтавок = КоличествоСтавок;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗаписатьНабор Тогда
			
			НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьОбновлениеУсловныхДвижений", Истина);
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТекущийНабор.Период КАК Период,
		|	ТекущийНабор.Сотрудник КАК Сотрудник
		|ИЗ
		|	ВТТекущийНабор КАК ТекущийНабор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеПозицииШтатногоРасписания КАК ДругиеНаборы
		|		ПО (ДругиеНаборы.Период > ТекущийНабор.ДатаОтменыУсловногоДвижения)
		|			И (ДругиеНаборы.Период < ТекущийНабор.Период)
		|			И (ДругиеНаборы.Сотрудник = ТекущийНабор.Сотрудник)
		|ГДЕ
		|	ДругиеНаборы.Регистратор <> &Регистратор
		|	И НЕ ДругиеНаборы.УсловноеДвижение
		|	И ТекущийНабор.УсловноеДвижение";
	
	// Обнулим ресурс в текущем объекте.
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Для Каждого Строка Из ЭтотОбъект Цикл
			
			Если Строка.Сотрудник = Выборка.Сотрудник И Строка.Период = Выборка.Период И Строка.УсловноеДвижение Тогда
				Строка.КоличествоСтавок = 0;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
